In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

In [2]:
import numpy as np
import pandas as pd

In [3]:
random_num = np. random.randint(1, 101, [3, 3])
random_num

array([[ 3,  3, 79],
       [38, 71, 77],
       [50, 42, 86]])

In [4]:
df_num = pd.DataFrame(random_num)
df_num
# DataFrame  표와 같이 row, culom 생성

    0   1   2
0   3   3  79
1  38  71  77
2  50  42  86

In [5]:
df_num = pd.DataFrame(random_num, index=["row1", "row2", "row3"])
df_num

       0   1   2
row1   3   3  79
row2  38  71  77
row3  50  42  86

In [8]:
df_num = pd.DataFrame(random_num, 
                      index=["row1", "row2", "row3"],
                     columns=["col1", "col2", "col3"])
df_num
# 얘네가 사실은 인덱스구나  rows랑 col

      col1  col2  col3
row1     3     3    79
row2    38    71    77
row3    50    42    86

In [10]:
books = {"title":["개미", "고구려", "드래곤라자", "퇴마록"],
        "writer":["베르나르베르베르", "김진명", "이영도", "이우혁"],
        "publisher":["열린책들", "이타북스", "황금가지", "들녘"],
        "1st-edition":["2013-05-30", "2011-02-28", "1998-05-30", "1994-01-01"],
        "price": [15800, 15800, 6300, 8550]}
books

{'title': ['개미', '고구려', '드래곤라자', '퇴마록'],
 'writer': ['베르나르베르베르', '김진명', '이영도', '이우혁'],
 'publisher': ['열린책들', '이타북스', '황금가지', '들녘'],
 '1st-edition': ['2013-05-30', '2011-02-28', '1998-05-30', '1994-01-01'],
 'price': [15800, 15800, 6300, 8550]}

In [12]:
df_books = pd.DataFrame(books)
df_books

   title    writer publisher 1st-edition  price
0     개미  베르나르베르베르      열린책들  2013-05-30  15800
1    고구려       김진명      이타북스  2011-02-28  15800
2  드래곤라자       이영도      황금가지  1998-05-30   6300
3    퇴마록       이우혁        들녘  1994-01-01   8550

In [13]:
df_books.index
df_books.columns
df_books.shape  #4, 5  행렬
df_books.size
df_books.dtypes  # 어제 ndarray는 문자가 있으면 나머지도 다 문자로 바꿨는데 지금은 아니네? price
df_books.count()

RangeIndex(start=0, stop=4, step=1)

Index(['title', 'writer', 'publisher', '1st-edition', 'price'], dtype='object')

(4, 5)

20

title          object
writer         object
publisher      object
1st-edition    object
price           int64
dtype: object

title          4
writer         4
publisher      4
1st-edition    4
price          4
dtype: int64

In [16]:
df_books.info
type(df_books.info)

<bound method DataFrame.info of    title    writer publisher 1st-edition  price
0     개미  베르나르베르베르      열린책들  2013-05-30  15800
1    고구려       김진명      이타북스  2011-02-28  15800
2  드래곤라자       이영도      황금가지  1998-05-30   6300
3    퇴마록       이우혁        들녘  1994-01-01   8550>

method

In [17]:
df_books.info()
type(df_books.info())
# ()는 무슨 차이일까?  df_books.info은 함수 만들어 놓은거고 df_books.info()는 함수 실행하는 것

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   title        4 non-null      object
 1   writer       4 non-null      object
 2   publisher    4 non-null      object
 3   1st-edition  4 non-null      object
 4   price        4 non-null      int64
dtypes: int64(1), object(4)
memory usage: 288.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   title        4 non-null      object
 1   writer       4 non-null      object
 2   publisher    4 non-null      object
 3   1st-edition  4 non-null      object
 4   price        4 non-null      int64
dtypes: int64(1), object(4)
memory usage: 288.0+ bytes

NoneType

In [19]:
df_books["title"]
type(df_books["title"])
#  series type이네?  데이터는 시리즈가 여러개 포함되어있다 라고 생각하면 된다 했는데
# DataFrane 자체가 시리즈인가?  반대인가? 시리즈가 여러개인게 DataFrane인가?

0       개미
1      고구려
2    드래곤라자
3      퇴마록
Name: title, dtype: object

pandas.core.series.Series

In [20]:
# 내가 원하는걸 가져오려면 어떻게 해야할까? 인덱스로 가져오면 된다.
df_books["title"][2]

'드래곤라자'

In [21]:
df_books["price"].max()

15800

In [22]:
df_books["price"].sort_values()
# .sort_values 낮은값부터 높은 값으로 출력하고 싶을 때

2     6300
3     8550
0    15800
1    15800
Name: price, dtype: int64

In [23]:
# 가격을 기준으로 정렬하기
df_books.sort_values(by="price")

   title    writer publisher 1st-edition  price
2  드래곤라자       이영도      황금가지  1998-05-30   6300
3    퇴마록       이우혁        들녘  1994-01-01   8550
0     개미  베르나르베르베르      열린책들  2013-05-30  15800
1    고구려       김진명      이타북스  2011-02-28  15800

In [24]:
# 거꾸로 출력해보기
df_books.sort_values(by="price",ascending=False)

   title    writer publisher 1st-edition  price
0     개미  베르나르베르베르      열린책들  2013-05-30  15800
1    고구려       김진명      이타북스  2011-02-28  15800
3    퇴마록       이우혁        들녘  1994-01-01   8550
2  드래곤라자       이영도      황금가지  1998-05-30   6300

In [26]:
# 가격과 초판인쇄를 가격이 큰 것부터, 초판 인쇄는 작은 것 부터 
df_books.sort_values(by=["price", "1st-edition"],
                    ascending=[False, True])
df_books

   title    writer publisher 1st-edition  price
1    고구려       김진명      이타북스  2011-02-28  15800
0     개미  베르나르베르베르      열린책들  2013-05-30  15800
3    퇴마록       이우혁        들녘  1994-01-01   8550
2  드래곤라자       이영도      황금가지  1998-05-30   6300

   title    writer publisher 1st-edition  price
0     개미  베르나르베르베르      열린책들  2013-05-30  15800
1    고구려       김진명      이타북스  2011-02-28  15800
2  드래곤라자       이영도      황금가지  1998-05-30   6300
3    퇴마록       이우혁        들녘  1994-01-01   8550

In [27]:
df_books.sort_index(axis=1)

  1st-edition  price publisher  title    writer
0  2013-05-30  15800      열린책들     개미  베르나르베르베르
1  2011-02-28  15800      이타북스    고구려       김진명
2  1998-05-30   6300      황금가지  드래곤라자       이영도
3  1994-01-01   8550        들녘    퇴마록       이우혁

In [28]:
df_books.sort_values(by="price",ascending=False)

   title    writer publisher 1st-edition  price
0     개미  베르나르베르베르      열린책들  2013-05-30  15800
1    고구려       김진명      이타북스  2011-02-28  15800
3    퇴마록       이우혁        들녘  1994-01-01   8550
2  드래곤라자       이영도      황금가지  1998-05-30   6300

In [29]:
df_books.index
df_books.values

RangeIndex(start=0, stop=4, step=1)

array([['개미', '베르나르베르베르', '열린책들', '2013-05-30', 15800],
       ['고구려', '김진명', '이타북스', '2011-02-28', 15800],
       ['드래곤라자', '이영도', '황금가지', '1998-05-30', 6300],
       ['퇴마록', '이우혁', '들녘', '1994-01-01', 8550]], dtype=object)

In [30]:
df_books["title"]

0       개미
1      고구려
2    드래곤라자
3      퇴마록
Name: title, dtype: object

In [31]:
df_books.title

0       개미
1      고구려
2    드래곤라자
3      퇴마록
Name: title, dtype: object

In [32]:
# 가격 높은순으로 3개 골라줘
df_books.nlargest(3, columns="price")

  title    writer publisher 1st-edition  price
0    개미  베르나르베르베르      열린책들  2013-05-30  15800
1   고구려       김진명      이타북스  2011-02-28  15800
3   퇴마록       이우혁        들녘  1994-01-01   8550

In [33]:
# 가격 낮은순으로 3개 골라줘
df_books.nsmallest(3, columns="price")

   title    writer publisher 1st-edition  price
2  드래곤라자       이영도      황금가지  1998-05-30   6300
3    퇴마록       이우혁        들녘  1994-01-01   8550
0     개미  베르나르베르베르      열린책들  2013-05-30  15800

In [34]:
df_books.sum()

title                                     개미고구려드래곤라자퇴마록
writer                                베르나르베르베르김진명이영도이우혁
publisher                                열린책들이타북스황금가지들녘
1st-edition    2013-05-302011-02-281998-05-301994-01-01
price                                             46450
dtype: object

In [35]:
df_title = df_books.set_index("title")
df_title

         writer publisher 1st-edition  price
title
개미     베르나르베르베르      열린책들  2013-05-30  15800
고구려         김진명      이타북스  2011-02-28  15800
드래곤라자       이영도      황금가지  1998-05-30   6300
퇴마록         이우혁        들녘  1994-01-01   8550

In [40]:
df_books
df_title
# 컬럼 값을 인덱스로 바꾸어버린 것  그래서 앞에 숫자가 사라지고

   title    writer publisher 1st-edition  price
0     개미  베르나르베르베르      열린책들  2013-05-30  15800
1    고구려       김진명      이타북스  2011-02-28  15800
2  드래곤라자       이영도      황금가지  1998-05-30   6300
3    퇴마록       이우혁        들녘  1994-01-01   8550

         writer publisher 1st-edition  price
title
개미     베르나르베르베르      열린책들  2013-05-30  15800
고구려         김진명      이타북스  2011-02-28  15800
드래곤라자       이영도      황금가지  1998-05-30   6300
퇴마록         이우혁        들녘  1994-01-01   8550

In [39]:

df_books["writer"][0]
df_title["writer"]["고구려"]

'베르나르베르베르'

'김진명'

In [41]:
df_title.reset_index()
# reset_index()하면 다시 인덱스 01234가 되는 것

   title    writer publisher 1st-edition  price
0     개미  베르나르베르베르      열린책들  2013-05-30  15800
1    고구려       김진명      이타북스  2011-02-28  15800
2  드래곤라자       이영도      황금가지  1998-05-30   6300
3    퇴마록       이우혁        들녘  1994-01-01   8550

In [42]:
df_title.sum()

writer                                베르나르베르베르김진명이영도이우혁
publisher                                열린책들이타북스황금가지들녘
1st-edition    2013-05-302011-02-281998-05-301994-01-01
price                                             46450
dtype: object

In [43]:
# 숫자값이 하나면 하나의 컬럼만 더한다.
df_title.sum(numeric_only=True)

price    46450
dtype: int64

In [45]:
df_title.median(numeric_only=True)

price    12175.0
dtype: float64

In [47]:
df_title["1st-edition"]
# object 문자열 객체

title
개미       2013-05-30
고구려      2011-02-28
드래곤라자    1998-05-30
퇴마록      1994-01-01
Name: 1st-edition, dtype: object

In [50]:
df_title["1st-edition"] = pd.to_datetime(df_title["1st-edition"])
#  datetime64[ns]  공식문서 확인하기

In [51]:
df_title.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 개미 to 퇴마록
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   writer       4 non-null      object
 1   publisher    4 non-null      object
 2   1st-edition  4 non-null      datetime64[ns]
 3   price        4 non-null      int64
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 332.0+ bytes

In [55]:
df_books.select_dtypes("object")

   title    writer publisher 1st-edition
0     개미  베르나르베르베르      열린책들  2013-05-30
1    고구려       김진명      이타북스  2011-02-28
2  드래곤라자       이영도      황금가지  1998-05-30
3    퇴마록       이우혁        들녘  1994-01-01

In [56]:
df_title.select_dtypes("object")

         writer publisher
title
개미     베르나르베르베르      열린책들
고구려         김진명      이타북스
드래곤라자       이영도      황금가지
퇴마록         이우혁        들녘

In [58]:
df_title.select_dtypes(include="object")

         writer publisher
title
개미     베르나르베르베르      열린책들
고구려         김진명      이타북스
드래곤라자       이영도      황금가지
퇴마록         이우혁        들녘

In [60]:
df_title.select_dtypes(exclude="object")

      1st-edition  price
title
개미     2013-05-30  15800
고구려    2011-02-28  15800
드래곤라자  1998-05-30   6300
퇴마록    1994-01-01   8550

In [61]:
df_title

         writer publisher 1st-edition  price
title
개미     베르나르베르베르      열린책들  2013-05-30  15800
고구려         김진명      이타북스  2011-02-28  15800
드래곤라자       이영도      황금가지  1998-05-30   6300
퇴마록         이우혁        들녘  1994-01-01   8550

In [64]:
df_title[["writer","price"]]

         writer  price
title
개미     베르나르베르베르  15800
고구려         김진명  15800
드래곤라자       이영도   6300
퇴마록         이우혁   8550

In [67]:
df_title["writer"]
type(df_title["writer"])
# series
#  df_title["writer"] 1차원이고  df_title[["writer"]] 과는 차원이 다르다  2차원

title
개미       베르나르베르베르
고구려           김진명
드래곤라자         이영도
퇴마록           이우혁
Name: writer, dtype: object

pandas.core.series.Series

In [68]:
df_title[["writer"]]
type(df_title[["writer"]])
#  dataframe  DataFrame안에는 시리즈들+인덱스만 들어간다

         writer
title
개미     베르나르베르베르
고구려         김진명
드래곤라자       이영도
퇴마록         이우혁

pandas.core.frame.DataFrame

In [69]:
df_title.loc["드래곤라자"]
#  컬럼이 아니라 index로 찾고 싶을 때 loc를 사용한다.
# loc이 index로 검색하는거에요
# 아까 datetime으로 바꿔서 뒤에 00:00:00 가 나오는 것

writer                         이영도
publisher                     황금가지
1st-edition    1998-05-30 00:00:00
price                         6300
Name: 드래곤라자, dtype: object

In [72]:
df_title
# df_title은 제목이 index인 상태에요

         writer publisher 1st-edition  price
title
개미     베르나르베르베르      열린책들  2013-05-30  15800
고구려         김진명      이타북스  2011-02-28  15800
드래곤라자       이영도      황금가지  1998-05-30   6300
퇴마록         이우혁        들녘  1994-01-01   8550

In [71]:
df_title.loc[["드래곤라자", "퇴마록"]]

      writer publisher 1st-edition  price
title
드래곤라자    이영도      황금가지  1998-05-30   6300
퇴마록      이우혁        들녘  1994-01-01   8550

In [73]:
df_title.iloc[0]
# iloc : index location   인덱스에 있는 줄 하나를 row로 가져온다.
# loc는 인덱스 이름으로 가져오는데 iloc는 번지수로 가져오는구나
# ^^차이점

writer                    베르나르베르베르
publisher                     열린책들
1st-edition    2013-05-30 00:00:00
price                        15800
Name: 개미, dtype: object

In [74]:
df_title.iloc[2:4]

      writer publisher 1st-edition  price
title
드래곤라자    이영도      황금가지  1998-05-30   6300
퇴마록      이우혁        들녘  1994-01-01   8550